snlkuharlocal/src/Documents/ДопДанныеГТДкМашине/ДопДанныеГТДкМашине.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДопДанныеГТДкМашине</name>
  <basedOn>Document.Машина</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеГТД</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭД</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоБезУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормативУтилизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЭкологическогоСбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеГТДУпаковки</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭД</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭДНоменклатуры</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоБезУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормативУтилизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЭкологическогоСбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ДопДанныеГТДкМашине/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеЗаполнения = Неопределено Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
		ДокОснование = ДанныеЗаполнения;
		
		МассивДанныхЗаполнения = Новый Массив;
		МассивДанныхЗаполнения.Добавить(ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ДанныеЗаполнения", МассивДанныхЗаполнения);
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Возврат;
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомераГТД.ГТД КАК ГТД,
	|	НомераГТД.Модель.ТНВЭД КАК ТНВЭД,
	|	ЕСТЬNULL(НомераГТД.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.НормативУтилизации, 0) КАК НормативУтилизации,
	|	ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.СтавкаЭкологическогоСбора, 0) КАК СтавкаЭкологическогоСбора,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0) <> 0
	|			ТОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесНетто,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Модель.ВесБрутто, 0) <> 0
	|			ТОГДА ЕСТЬNULL(НомераГТД.Модель.ВесБрутто, 0)
	|		ИНАЧЕ ЕСТЬNULL(НомераГТД.Модель.ВесБруттоШтуки, 0)
	|	КОНЕЦ КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0) <> 0
	|			ТОГДА ЕСТЬNULL(НомераГТД.Модель.ВесНетто, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ * ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.НормативУтилизации, 0) * ЕСТЬNULL(НомераГТД.Модель.ТНВЭД.СтавкаЭкологическогоСбора, 0) КАК Всего
	|ИЗ
	|	Документ.Машина.НомераГТД КАК НомераГТД
	|ГДЕ
	|	НомераГТД.Ссылка В(&ДанныеЗаполнения)";
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеГТД.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокОснование = Неопределено;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		Префикс = ЗаполнениеДокументов.ПользовательскийПрефикс(СокрЛП(ДокОснование.Номер));
	КонецЕсли;
	
КонецПроцедуры
